ERP DEV.WMS/src/Documents/вмс_СводныйДокумент/вмс_СводныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_СводныйДокумент</name>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/Documents/вмс_СводныйДокумент/ManagerModule.bsl
Функция ПолучитьСводныеДокументы(ДокументыОснования, СоздатьЕслиНеНайден=Истина) Экспорт
	
	Возврат Новый Массив;

	РК = вмс_РаботаСКоллекциями;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вмс_СводныйДокументДокументыОснования.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СводныеДокументы
	|ИЗ
	|	Документ.вмс_СводныйДокумент.ДокументыОснования КАК вмс_СводныйДокументДокументыОснования
	|ГДЕ
	|	вмс_СводныйДокументДокументыОснования.Документ В(&ДокументыОснования)
	|	И НЕ вмс_СводныйДокументДокументыОснования.Ссылка.ПометкаУдаления
	| 	И вмс_СводныйДокументДокументыОснования.Документ.Дата > &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СводныеДокументы.Ссылка КАК Ссылка,
	|	вмс_СводныйДокументДокументыОснования.Документ КАК Документ
	|ИЗ
	|	ВТ_СводныеДокументы КАК ВТ_СводныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вмс_СводныйДокумент.ДокументыОснования КАК вмс_СводныйДокументДокументыОснования
	|		ПО ВТ_СводныеДокументы.Ссылка = вмс_СводныйДокументДокументыОснования.Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("ДокументыОснования", ДокументыОснования);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСводныхДокументов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СводныеДокументы = Новый Массив;
	Если ВыборкаСводныхДокументов.Количество() > 1 Тогда
		Пока ВыборкаСводныхДокументов.Следующий() Цикл
			СводныеДокументы.Добавить(ВыборкаСводныхДокументов.Ссылка);
		КонецЦикла;
		Возврат СводныеДокументы;
	КонецЕсли;
	
	Если ВыборкаСводныхДокументов.Следующий() Тогда
		СводныйДокумент = ВыборкаСводныхДокументов.Ссылка;
		ВыборкаОснований = ВыборкаСводныхДокументов.Выбрать();
		ДобавитьОснования = Новый Массив;
		Для Каждого Основание Из ДокументыОснования Цикл
			Если НЕ ВыборкаОснований.НайтиСледующий(Новый Структура("Документ", Основание)) Тогда
				ДобавитьОснования.Добавить(Основание);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Не СоздатьЕслиНеНайден Тогда
			Возврат СводныеДокументы;
		КонецЕсли;
		
		СводныйДокументОбъект = Документы.вмс_СводныйДокумент.СоздатьДокумент();
		СводныйДокументОбъект.Заполнить(Неопределено);
		СводныйДокументОбъект.Дата = ТекущаяДата();
		ДобавитьОснования = РК.ЗначениеВМассив(ДокументыОснования);
	КонецЕсли;
	
	Если ДобавитьОснования.Количество() > 0 Тогда
		Если СводныйДокументОбъект = Неопределено Тогда
			СводныйДокументОбъект = СводныйДокумент.ПолучитьОбъект();
		КонецЕсли;
		
		Для Каждого Основание Из ДобавитьОснования Цикл
			СтрокаДокументаОснования = СводныйДокументОбъект.ДокументыОснования.Добавить();
			СтрокаДокументаОснования.Документ = Основание;
		КонецЦикла;
		
		СводныйДокументОбъект.Записать();
		СводныйДокумент = СводныйДокументОбъект.Ссылка;
	КонецЕсли;
	
	СводныеДокументы.Добавить(СводныйДокумент);
	
	Возврат СводныеДокументы;
	
КонецФункции
